docs: use mermaid for network architecture
